{"modelTopology": {"node": [{"name": "ArgMax/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Placeholder_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "25"}]}}}}, {"name": "Variable_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}]}}}}}, {"name": "Variable_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "25"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "Variable_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3136"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "Variable_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Variable", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "Placeholder", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}}, {"name": "Placeholder_2", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout/sub/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ArgMax_1", "op": "ArgMax", "input": ["Placeholder_1", "ArgMax/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}, {"name": "Reshape", "op": "Reshape", "input": ["Placeholder", "Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "sub", "op": "Sub", "input": ["dropout/sub/x", "Placeholder_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D", "op": "Conv2D", "input": ["Reshape", "Variable"], "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "dropout/sub", "op": "Sub", "input": ["dropout/sub/x", "sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "Add", "input": ["Conv2D", "Variable_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool", "op": "MaxPool", "input": ["Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "Conv2D_1", "op": "Conv2D", "input": ["MaxPool", "Variable_2"], "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_1", "op": "Add", "input": ["Conv2D_1", "Variable_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_1", "op": "Relu", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool_1", "op": "MaxPool", "input": ["Relu_1"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "Reshape_1", "op": "Reshape", "input": ["MaxPool_1", "Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "MatMul", "op": "MatMul", "input": ["Reshape_1", "Variable_4"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "add_2", "op": "Add", "input": ["MatMul", "Variable_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_2", "op": "Relu", "input": ["add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/Shape", "op": "Shape", "input": ["Relu_2"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "dropout/truediv", "op": "RealDiv", "input": ["Relu_2", "dropout/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/random_uniform/RandomUniform", "op": "RandomUniform", "input": ["dropout/Shape"], "attr": {"seed2": {"i": "0"}, "seed": {"i": "0"}, "T": {"type": "DT_INT32"}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dropout/add", "op": "Add", "input": ["dropout/sub", "dropout/random_uniform/RandomUniform"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/Floor", "op": "Floor", "input": ["dropout/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dropout/mul", "op": "Mul", "input": ["dropout/truediv", "dropout/Floor"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_1", "op": "MatMul", "input": ["dropout/mul", "Variable_6"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "add_3", "op": "Add", "input": ["MatMul_1", "Variable_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "ArgMax", "op": "ArgMax", "input": ["add_3", "ArgMax/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "output_type": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model", "op": "Equal", "input": ["ArgMax", "ArgMax_1"], "attr": {"T": {"type": "DT_INT64"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of4", "group1-shard2of4", "group1-shard3of4", "group1-shard4of4"], "weights": [{"name": "ArgMax/dimension", "shape": [], "dtype": "int32"}, {"name": "Variable_7", "shape": [25], "dtype": "float32"}, {"name": "Variable_6", "shape": [1024, 25], "dtype": "float32"}, {"name": "Variable_5", "shape": [1024], "dtype": "float32"}, {"name": "Variable_4", "shape": [3136, 1024], "dtype": "float32"}, {"name": "Reshape_1/shape", "shape": [2], "dtype": "int32"}, {"name": "Variable_3", "shape": [64], "dtype": "float32"}, {"name": "Variable_2", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "Variable_1", "shape": [32], "dtype": "float32"}, {"name": "Variable", "shape": [7, 7, 1, 32], "dtype": "float32"}, {"name": "Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "dropout/sub/x", "shape": [], "dtype": "float32"}]}]}